PedroFnseca/esp32-http-client/tests/test_rest_request.cpp
  req.getBody("address.street", street, sizeof(street))
      .getBody("address.geo.lat", &lat);

  StringStream stream(
      R"({
        "id": 1,
        "name": "Leanne Graham",
        "username": "Bret",
        "email": "Sincere@april.biz",
        "address": {
          "street": "Kulas Light",
          "suite": "Apt. 556",
          "city": "Gwenborough",
          "zipcode": "92998-3874",
          "geo": {
            "lat": "-37.3159",
            "lng": "81.1496"
          }
        },
        "phone": "1-770-736-8031 x56442",
        "website": "hildegard.org",
        "company": {
          "name": "Romaguera-Crona",
          "catchPhrase": "Multi-layered client-server neural-net",
          "bs": "harness real-time e-markets"
        }
      })");
  
  BufferedStreamReader reader(&stream);
  req.parseResponse(reader);

  expectTrue(strlen(street) > 0, "street should be populated");
  expectTrue(lat != 0.0f, "lat should be populated and parsed as float");

  req._executed = true;
}

void testParseNestedJSONMissingFields() {
  ESP32HTTPClient client("https://jsonplaceholder.typicode.com");
  RestRequest req(&client, "/users/1", HTTP_GET_METHOD);

  char invalidStreet[64] = {0};
  float invalidLat = 0.0f;

  // Requesting fields that don't exist in the JSON
  req.getBody("address.unknown_street", invalidStreet, sizeof(invalidStreet))
      .getBody("address.not_found.deep", &invalidLat);

  StringStream stream(
      R"({
        "address": {
          "street": "Kulas Light",
          "geo": {
            "lat": "-37.3159"
          }
        }
      })");
  
  BufferedStreamReader reader(&stream);
  req.parseResponse(reader);

  expectTrue(strlen(invalidStreet) == 0, "missing string field should remain empty");
  expectTrue(invalidLat == 0.0f, "missing float field should remain unchanged (0.0f)");

  req._executed = true;
}

void testParseRawArrayJSON() {
  ESP32HTTPClient client("https://jsonplaceholder.typicode.com");
  RestRequest req(&client, "/users", HTTP_GET_METHOD);

  String entireArray = "";
  String specificObject = "";
  String notFound = "original";

  req.getBody("", &entireArray) // match the root array
     .getBody("5.unknown", &notFound);

  StringStream stream1(
      R"([
        {
          "name": "Leanne Graham",
          "address": { "city": "Gwenborough" }
        },
        {
          "name": "Ervin Howell",
          "address": {
            "city": "Wisokyburgh",
            "geo": { "lat": "-43.9509" }
          }
        }
      ])");
  
  BufferedStreamReader reader1(&stream1);
  req.parseResponse(reader1);

  // Asserting successful cases for root array
  expectTrue(entireArray.str().length() > 50, "entireArray should contain the raw JSON string of the root array");
  expectTrue(entireArray.str().substr(0, 1) == "[", "entireArray should start with [");
  
  // Asserting failure case
  expectEq(notFound.str(), "original", "notFound should remain unchanged if path does not exist");

  // Now test nested object raw extraction independently (as root extraction consumes the whole stream)
  RestRequest req2(&client, "/users", HTTP_GET_METHOD);
  req2.getBody("1.address", &specificObject);

  StringStream stream2(
      R"([
        {
          "name": "Leanne Graham",
          "address": { "city": "Gwenborough" }
        },
        {
          "name": "Ervin Howell",
          "address": {
            "city": "Wisokyburgh",
            "geo": { "lat": "-43.9509" }
          }
        }
      ])");
  
  BufferedStreamReader reader2(&stream2);
  req2.parseResponse(reader2);

  expectTrue(specificObject.str().length() > 20, "specificObject should contain the raw JSON string of the nested object");
  expectTrue(specificObject.str().substr(0, 1) == "{", "specificObject should start with {");

  req._executed = true;
}
void testUnixTimestampFetch() {
  HttpClientStub::reset();
  HttpClientStub::setResponse(200, R"({"unix_timestamp":1781301337})");

  ESP32HTTPClient client("https://timeapi.io");
  
  long ts = 0;
  {
    client.get("/api/v1/time/current/unix")
          .getBody("unix_timestamp", &ts);
  }

  expectEq(HttpClientStub::lastMethod, "GET", "should use GET method");
  expectEq(HttpClientStub::lastUrl, "https://timeapi.io/api/v1/time/current/unix", "url should be correct");
  expectEqInt(ts, 1781301337L, "unix_timestamp should be successfully parsed");
}
void testClientConfiguration() {
  ESP32HTTPClient client("https://example.com");
  client.setContentType("text/plain");
  client.setHeader("X-Custom", "value1");
  
  HttpClientStub::reset();
  client.post("/upload").body("data", "hello").getBody("ignored", (int*)nullptr);
  
  expectEq(HttpClientStub::lastUrl, "https://example.com/upload", "url matches");
  expectEq(HttpClientStub::lastMethod, "POST", "method matches");
  
  client.end(); // covers the end() method
}

void testAllHttpMethods() {
  HttpClientStub::reset();
  ESP32HTTPClient client("http://test", 8080);
  
  client.put("/").getBody("i", (int*)nullptr);
  expectEq(HttpClientStub::lastMethod, "PUT", "put uses PUT");
  
  client.patch("/").getBody("i", (int*)nullptr);
  expectEq(HttpClientStub::lastMethod, "PATCH", "patch uses PATCH");
  
  client.del("/").getBody("i", (int*)nullptr);
  expectEq(HttpClientStub::lastMethod, "DELETE", "del uses DELETE");
}

void testAutoRetry() {
  HttpClientStub::reset();
  HttpClientStub::setResponse(-1, ""); // first attempt fails
  
  ESP32HTTPClient client("http://retry");
  client.get("/").getBody("i", (int*)nullptr);
  
  expectEqInt(client.getStatusCode(), -1, "status code propagates from retry loop");
}

void testChunkedTransferEncoding() {
  ESP32HTTPClient client("https://example.com");
  RestRequest req(&client, "/chunked", HTTP_GET_METHOD);
  char buf[32] = {0};
  req.getBody("msg", buf, sizeof(buf));
  
  StringStream stream("e\r\n{\"msg\":\"hello \r\n7\r\nworld\"}\r\n0\r\n\r\n");
  BufferedStreamReader reader(&stream, true);
  req.parseResponse(reader);
  
  expectEq(buf, "hello world", "chunked data should be correctly reassembled inside parseResponse");
  req._executed = true;
}

void testLargePayloadRefill() {
  ESP32HTTPClient client("https://example.com");
  RestRequest req(&client, "/large", HTTP_GET_METHOD);
  char buf[32] = {0};
  req.getBody("end", buf, sizeof(buf));
  
  std::string largeData = "{\"pad\":\"";
  largeData.append(600, 'A');
  largeData += "\",\"end\":\"found\"}";
  
